win95/RTOS-STM32f407/main.c
}

void vMain(void *pvParameters)
{
	/* init DTMF*/
	TM_GPIO_Init(DTMF_BIT0_PORT, DTMF_BIT0_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	TM_GPIO_Init(DTMF_BIT1_PORT, DTMF_BIT1_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	TM_GPIO_Init(DTMF_BIT2_PORT, DTMF_BIT2_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	TM_GPIO_Init(DTMF_BIT3_PORT, DTMF_BIT3_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_Low);
	/* DTMF*/
		if (TM_EXTI_Attach(DFMF_BIT4_PORT, DTMF_BIT4_PIN, TM_EXTI_Trigger_Rising) == TM_EXTI_Result_Ok) {
		printf_d("DFMF_BIT4 init\n");
	}	
	/*init interrup INPUT*/
		TM_EXTI_Attach(W2_D0_PORT, W2_D0_PIN, TM_EXTI_Trigger_Falling);
		TM_EXTI_Attach(W2_D1_PORT, W2_D1_PIN, TM_EXTI_Trigger_Falling);
		TM_EXTI_Attach(W1_D1_PORT, W1_D1_PIN, TM_EXTI_Trigger_Rising);
		TM_EXTI_Attach(W1_D0_PORT, W1_D0_PIN, TM_EXTI_Trigger_Rising);
		/*init SWADD*/
	TM_GPIO_Init(ADD_BIT0_PORT, ADD_BIT0_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);	
	TM_GPIO_Init(ADD_BIT1_PORT, ADD_BIT1_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
	TM_GPIO_Init(ADD_BIT2_PORT, ADD_BIT2_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
	TM_GPIO_Init(ADD_BIT3_PORT, ADD_BIT3_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
	TM_GPIO_Init(ADD_BIT4_PORT, ADD_BIT4_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
	TM_GPIO_Init(ADD_BIT5_PORT, ADD_BIT5_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
	TM_GPIO_Init(ADD_BIT6_PORT, ADD_BIT6_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
	TM_GPIO_Init(ADD_BIT7_PORT, ADD_BIT7_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Medium);
/* int DIR 485 set = send , reset = recvice*/ 
	TM_GPIO_Init(CCU_DIR_PORT, CCU_DIR_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_High);
	TM_GPIO_SetPinHigh(CCU_DIR_PORT,CCU_DIR_PIN);
	/* Init LCD*/
	TM_GPIO_Init(HD44780_RW_PORT, HD44780_RW_PIN, TM_GPIO_Mode_OUT, TM_GPIO_OType_PP, TM_GPIO_PuPd_NOPULL, TM_GPIO_Speed_High);
	TM_GPIO_SetPinLow(HD44780_RW_PORT,HD44780_RW_PIN);
	read_sw_add();
	sprintf(ACM,"ACM%d",value_dip);
	timeout = 60;
	memset(str,'\0',0);
	//Initialize LCD 20 cols x 4 rows
	TM_HD44780_Init(16, 4);
	//Save custom character on location 0 in LCD
	TM_HD44780_CreateChar(0, &customChar[0]);    
	//Put string to LCD
	TM_HD44780_Puts(0, 0, "FREERTOS-STM32\n\rCreartbyR&D-TIS"); /* 0 dong 1, 1 dong 2*/
	TM_HD44780_Puts(0, 2, "Welcome");
	vTaskDelay(2000);
	TM_HD44780_Clear();
	sprintf(str,"Timerout %d", timeout);
	TM_HD44780_Puts(0, 0,str);
	vTaskDelay(2000);
	sprintf(str,"ACM: %5s", ACM);
	TM_HD44780_Puts(0, 0,str);
	vTaskDelay(2000);
	TM_HD44780_Clear();
	TM_HD44780_Puts(0, 0,"----TIS8 PRO----");
	flag_RFID2=0;	
	flag_RFID1=0;
// configure role mo rong
	turn_off_dk3();
	turn_off_dk4();
	//tcpclient->state=0;
	bandau:
	sprintf(data_tcp,"(1,%s,00 00 00 00 00 00 00,1,,12-0-0/1-1-14)",ACM);
	vTaskDelay(10);
	TM_ETHERNETCLIENT_Connect("server",192,168,1,250,8866,&requests_count);
	/*end by duc*/
	TM_WATCHDOG_Reset();
	for(;;)
	{
/*process server control*/
/*process 485*/
	if(flag_485){
	flag_485=0;
	if(LEDStatus==0) TM_USART_Puts(USART1, "/LED000>\r\n");
	if(LEDStatus==1) TM_USART_Puts(USART1, "/LED001>\r\n");
	if(LEDStatus==2) TM_USART_Puts(USART1, "/LED002>\r\n");
	
	sprintf(str,"send %3d rev %3d stt %d",turnsend,turnrecv,tcpclient->state);
	TM_HD44780_Puts(2, 0,str);
	//if(tcpclient->state==CLIENT_CONNECTED){
//	sprintf(data_tcp,"(1,%s,%s,1,,12-0-0/1-1-14)",ACM,"01 01 01 01 01 01");
//	TM_ETHERNETCLIENT_Connect("server",192,168,1,250,8866,&requests_count);
	//}
	//else goto bandau;
	}	

/* xu li W1D0 - dk1*/
	if(flag_W1D0 && !LEDStatus){
		turn_on_dk1();
		turn_on_dk3();
	}
/* xu li W1D1 - dk2*/
	if(flag_W1D1 && !LEDStatus){
		turn_on_dk2();
		turn_on_dk4();
	}
/*xu li 1 tien trinh hoan chinh*/
	if(Process!=1) TM_HD44780_Puts(0, 2,"Wait for Card\n\r xx"); /* 0 dong 1, 1 dong 2*/
/*xu li khi co su kien nhan the*/
if(flag_RFID1==1){	
		
		Process=1;
		IDCAR1[0]=BufferCom1[4];
		IDCAR1[1]=BufferCom1[5];
		IDCAR1[2]=BufferCom1[6];
		IDCAR1[3]=BufferCom1[7];
		IDCAR1[4]=BufferCom1[8];
		IDCAR1[5]=BufferCom1[9];
		IDCAR1[6]=BufferCom1[10];
		
		if(BufferCom1[1]==0x08)	
			{
			sprintf(UID1,"%02x %02x %02x %02x",IDCAR1[0],IDCAR1[1],IDCAR1[2],IDCAR1[3]);
			}
		if(BufferCom1[1]==0x0B) 
			{
			sprintf(UID1,"%02x %02x %02x %02x %02x %02x %02x",IDCAR1[0],IDCAR1[1],IDCAR1[2],IDCAR1[3],IDCAR1[4],IDCAR1[5],IDCAR1[6]);
			}
		TM_HD44780_Puts(0, 2,"Waiting PC..."); /* 0 dong 1, 1 dong 2*/
		vTaskDelay(20);
		if(check_vip(UID1)){
			flag_PC=1;
			flag_R10=1;
			timerdk1 =0;
			flag_R21=1;
			timerdk4 =0;
			Process=0;
		}
		else{
		if(Process){
		if(UID1 != NULL){
		sprintf(data_tcp,"(1,%s,%s,1,,12-0-0/1-1-14)",ACM,UID1);
		TM_ETHERNETCLIENT_Connect("server",192,168,1,250,8866,&requests_count);
		vTaskDelay(10);
		TM_USART_Puts(USART3,UID1);
		memset(UID1,NULL,0);
		}
		}
		}
		WaitPC(200);
		flag_RFID1=0;
		if(flag_PC)
		{
			TM_HD44780_Puts(0, 2,"Door opened.."); /* 0 dong 1, 1 dong 2*/
			flag_PC=0;
			ProcessAction();
			WaitPC(10);
		}
		else Process=0;
		flag_RFID1=0;	
		flag_test=0;
	}
if(flag_RFID2==1){		
}
if(flag_serve==1){
	flag_serve=0;
	Serveprocess(0,0);
}	
if(flag_test==1) {
	flag_test=0;
	ProcessAction();
}

/* Quan li thoi gian cho tung su kien relay actived*/
timer_dk1 = timerdk1/2;	
if (timer_dk1 >= timeout){
			turn_off_dk1();
			flag_R10 =0;
			flag_W1D0=0;
			timerdk1=0;
			timer_dk1=0;
			flag_RFID1=0;
			flag_RFID2=0;
			Process=0;
			WaitPC(200);
		}
timer_dk2 = timerdk2/2;
if (timer_dk2 >= timeout){
			turn_off_dk2();
			flag_R20 =0;
			flag_R31 =0;
			flag_W1D1=0;
			timerdk2=0;
			timer_dk2=0;
			Process=0;
			WaitPC(100);
		}
timer_dk3 = timerdk3;
if (timer_dk3 >= 4){
			turn_off_dk3();
			flag_R11 =0;
			flag_R12 =0;
			timerdk3=0;
			timer_dk3=0;
			if(LEDStatus==0) {Process=0;WaitPC(100);}
		}
timer_dk4 = timerdk4;
if (timer_dk4 >= 4){
			turn_off_dk4();
			flag_R21 =0;
			flag_R22 =0;
			timer_dk4=0;
			timerdk4=0;
			if(LEDStatus==0) {Process=0;WaitPC(100);}
		}


		TM_WATCHDOG_Reset();
}
	}
//******************************************************************************
/* Tran duc code*/
void  printf_d(char *str){
	TM_USART_Puts(USART3,str);
}
void 	ProcessAction(void){
		if(strncmp(BufferCom3,"R10",3)==0) // mo relay 1
	{
		flag_R10=1;
		timerdk1 =0;
	}
		if(strncmp(BufferCom3,"R20",3)==0) // mo relay 2
	{
		flag_R20=1;
		timerdk2 =0;
	}
		if(strncmp(BufferCom3,"R11",3)==0) // nuot the mo relay 3
	{
		flag_R11=1;
		timerdk3 =0;
	}
		if(strncmp(BufferCom3,"R21",3)==0) // nha the mo relay 4
	{
		flag_R21=1;
		timerdk4 =0;
	}
	if(strncmp(BufferCom3,"R00",3)==0) // nha the mo relay 4
	{
	TM_USART_Puts(USART3,"OK");
	}

		if(flag_R10)
	{		// active relay 1
		turn_on_dk1();
	}
		if(flag_R20)
	{	// active relay 2
		turn_on_dk2();
	}
		if(flag_R11)
	{	// active relay 3
		turn_on_dk3();
	}
		if(flag_R21)
	{	// active relay 4
		turn_on_dk4();
	}
	/* xu li flag_R31 - dk2 tu com1*/
	if(flag_R31){
		turn_on_dk2();
	}
/* xu li flag_R12 - dk3 tu com1*/
	if(flag_R12){
		turn_on_dk3();
	}
/* xu li flag_R22 - dk4 tu com1*/
	if(flag_R22){
		turn_on_dk4();
	}
	
